# Que tipo de dados o Pandas processa?

In [2]:
import pandas as pd

In [3]:
dados = {
    'Nome': [
        'José Geraldo de Freitas',
        'Silvana Martins de Toledo',
        'Nícolas Martins de Freitas',
        'Danilo Martins de Freitas'
    ],
    'Sexo': [
        'Masculino',
        'Feminino',
        'Masculino',
        'Masculino'
    ],
    'Idade': [
        65,
        55,
        39,
        37
    ],
    'Cidade': [
        'Itabera',
        'São Paulo',
        'Assis',
        'São Paulo'
    ]
}

In [4]:
df = pd.DataFrame(dados)

In [5]:
df['Cidade']

0      Itabera
1    São Paulo
2        Assis
3    São Paulo
Name: Cidade, dtype: object

In [6]:
idade = pd.Series([65, 55, 39, 37], name='Idade')
idade

0    65
1    55
2    39
3    37
Name: Idade, dtype: int64

## Faça algo com Dataframe ou Series

In [7]:
# Usando o DataFrame

df['Idade'].max()

np.int64(65)

In [8]:
# Usando Series

idade.max()

np.int64(65)

In [9]:
# Por padrão o comando describe() pega apenas os valores númericos, dos tipos int ou float
df.describe()

           Idade
count   4.000000
mean   49.000000
std    13.366625
min    37.000000
25%    38.500000
50%    47.000000
75%    57.500000
max    65.000000

In [10]:
# Para o comando describe() analise todo o contexto, deve ser acresentado o parametro include='all'
df.describe(include='all')

                           Nome       Sexo      Idade     Cidade
count                         4          4   4.000000          4
unique                        4          2        NaN          3
top     José Geraldo de Freitas  Masculino        NaN  São Paulo
freq                          1          3        NaN          2
mean                        NaN        NaN  49.000000        NaN
std                         NaN        NaN  13.366625        NaN
min                         NaN        NaN  37.000000        NaN
25%                         NaN        NaN  38.500000        NaN
50%                         NaN        NaN  47.000000        NaN
75%                         NaN        NaN  57.500000        NaN
max                         NaN        NaN  65.000000        NaN

# Como fazer para ler e escrever dados tabular?

In [11]:
# Lê o arquio pandas.csv e armazena as informações na variável familia
familia = pd.read_csv("pandas.csv")
# Imprime o conteúdo da variável familia
familia

                         Nome       Sexo  Idade     Cidade
0     José Geraldo de Freitas  Masculino     66    Itaberá
1   Silvana Martins de Toledo   Feminino     55  São Paulo
2  Nícolas Martins de Freitas  Masculino     39      Assis
3   Danilo Martins de Freitas  Masculino     37  São Paulo

In [12]:
# Para ver os primeiros N dados do DataFrame,
familia.head(2)

                        Nome       Sexo  Idade     Cidade
0    José Geraldo de Freitas  Masculino     66    Itaberá
1  Silvana Martins de Toledo   Feminino     55  São Paulo

In [13]:
# Para ver os ultimos N dados do DataFrame.
familia.tail(3)

                         Nome       Sexo  Idade     Cidade
1   Silvana Martins de Toledo   Feminino     55  São Paulo
2  Nícolas Martins de Freitas  Masculino     39      Assis
3   Danilo Martins de Freitas  Masculino     37  São Paulo